; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	satellite7 - satellite
	instrument17 - instrument
	instrument18 - instrument
	satellite8 - satellite
	instrument19 - instrument
	instrument20 - instrument
	thermograph4 - mode
	thermograph5 - mode
	image2 - mode
	thermograph3 - mode
	thermograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph5)
	(supports instrument6 thermograph4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 spectrograph1)
	(supports instrument7 image2)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph4)
	(supports instrument8 thermograph3)
	(supports instrument8 image2)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph5)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
	(supports instrument10 thermograph5)
	(calibration_target instrument10 Star0)
	(supports instrument11 thermograph5)
	(supports instrument11 image2)
	(supports instrument11 thermograph4)
	(calibration_target instrument11 Star1)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
	(supports instrument13 thermograph5)
	(supports instrument13 thermograph4)
	(supports instrument13 thermograph3)
	(calibration_target instrument13 Star1)
	(supports instrument14 thermograph3)
	(supports instrument14 image2)
	(supports instrument14 thermograph4)
	(calibration_target instrument14 Star4)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
	(supports instrument15 thermograph4)
	(supports instrument15 thermograph5)
	(supports instrument15 thermograph3)
	(calibration_target instrument15 Star1)
	(supports instrument16 spectrograph1)
	(supports instrument16 thermograph3)
	(calibration_target instrument16 Star1)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star4)
	(supports instrument17 thermograph4)
	(supports instrument17 spectrograph1)
	(supports instrument17 image2)
	(calibration_target instrument17 Star4)
	(supports instrument18 thermograph5)
	(supports instrument18 thermograph4)
	(calibration_target instrument18 Star3)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation2)
	(supports instrument19 thermograph3)
	(calibration_target instrument19 GroundStation2)
	(supports instrument20 thermograph3)
	(calibration_target instrument20 Star1)
	(on_board instrument19 satellite8)
	(on_board instrument20 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star9)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite5 Star4)
	(pointing satellite7 Phenomenon6)
	(have_image Planet5 thermograph3)
	(have_image Phenomenon6 thermograph0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 thermograph3)
	(have_image Star9 thermograph3)
))

)

; plan
1. (turn_to satellite5 star4 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 star4)
   goals met: 1 of 8
2. (turn_to satellite2 star4 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star4)
   goals met: 1 of 8
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon8 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon8 instrument5 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 8
8. (turn_to satellite0 star4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star4)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon7 instrument5 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 8
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 8
11. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 8
12. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 8
13. (take_image satellite1 phenomenon6 instrument2 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite2 planet5 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet5)
   goals met: 5 of 8
15. (take_image satellite2 planet5 instrument5 thermograph3)
   added: (have_image planet5 thermograph3)
   goals met: 6 of 8
16. (turn_to satellite2 star9 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star9)
   goals met: 6 of 8
17. (take_image satellite2 star9 instrument5 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 8
18. (turn_to satellite7 phenomenon6 groundstation2)
   deleted: (pointing satellite7 groundstation2)
   added: (pointing satellite7 phenomenon6)
   goals met: 8 of 8
